using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Diagnostics;

namespace ShirenHUD
{
    class Item
    {
        public static readonly Dictionary<int, string> Names = new Dictionary<int, string>()
        {
            // 武器
            { 0x00, "こん棒" },
            { 0x01, "長巻" },
            { 0x02, "ブフーの包丁" },
            { 0x03, "カタナ" },
            { 0x04, "ドラゴンキラー" },
            { 0x05, "どうたぬき" },
            { 0x06, "剛剣マンジカブラ" },
            { 0x07, "成仏の鎌" },
            { 0x08, "つるはし" },
            { 0x09, "必中の剣" },
            { 0x0A, "ミノタウロスの斧" },
            { 0x0B, "妖刀かまいたち" },
            { 0x0C, "１ツ目殺し" },
            { 0x0D, "ドレインバスター" },
            { 0x0E, "火迅風魔刀" },
            { 0x0F, "秘剣カブラステギ" },

            // 矢
            { 0x10, "木の矢" }, 
            { 0x11, "鉄の矢" }, 
            { 0x12, "銀の矢" }, 
            { 0x13, "新規アイテム" }, 
            { 0x14, "新規アイテム" }, 
            { 0x15, "新規アイテム" }, 

            // 盾
            { 0x16, "皮甲の盾" },
            { 0x17, "青銅甲の盾" },
            { 0x18, "無どくの盾" },
            { 0x19, "木甲の盾" },
            { 0x1A, "鉄甲の盾" },
            { 0x1B, "ドラゴンシールド" },
            { 0x1C, "風魔の盾" },
            { 0x1D, "バトルカウンター" },
            { 0x1E, "重装の盾" },
            { 0x1F, "やまびこの盾" },
            { 0x20, "見切りの盾" },
            { 0x21, "見かけだおしの盾" },
            { 0x22, "使い捨ての盾" },
            { 0x23, "地雷ナバリの盾" },
            { 0x24, "トドの盾" },
            { 0x25, "ラセン風魔の盾" },
            { 0x26, "新規アイテム" },
            { 0x27, "新規アイテム" },

            // 草
            { 0x28, "薬草" },
            { 0x29, "弟切草" },
            { 0x2A, "しあわせ草" },
            { 0x2B, "めぐすり草" },
            { 0x2C, "ドラゴン草" },
            { 0x2D, "無敵草" },
            { 0x2E, "天使の種" },
            { 0x2F, "復活の草" },
            { 0x30, "消え去り草" },
            { 0x31, "くねくね草" },
            { 0x32, "不幸の種" },
            { 0x33, "超不幸の種" },
            { 0x34, "キグニ族の種" },
            { 0x35, "物忘れの草" },
            { 0x36, "－－－" }, // 置いた所にモンスターが集まるとされる草(効果なし)
            { 0x37, "命の草" },
            { 0x38, "胃拡張の種" },
            { 0x39, "胃縮小の種" },
            { 0x3A, "話の種" },
            { 0x3B, "ちからの草" },
            { 0x3C, "どく消し草" },
            { 0x3D, "どく草" },
            { 0x3E, "混乱草" },
            { 0x3F, "睡眠草" },
            { 0x40, "雑草" },
            { 0x41, "新規アイテム" },
            { 0x42, "新規アイテム" },
            { 0x43, "新規アイテム" },
            { 0x44, "新規アイテム" },
            { 0x45, "新規アイテム" },
            { 0x46, "新規アイテム" },
            { 0x47, "新規アイテム" },
            { 0x48, "新規アイテム" },
            { 0x49, "新規アイテム" },
            { 0x4A, "新規アイテム" },
            { 0x4B, "新規アイテム" },
            { 0x4C, "新規アイテム" },
            { 0x4D, "新規アイテム" },
            { 0x4E, "新規アイテム" },
            { 0x4F, "新規アイテム" },
            { 0x50, "新規アイテム" },
            { 0x51, "新規アイテム" },
            { 0x52, "新規アイテム" },
            { 0x53, "新規アイテム" },
            { 0x54, "新規アイテム" },
            { 0x55, "新規アイテム" },

            // 巻物
            { 0x56, "おはらいの巻物" },
            { 0x57, "識別の巻物" },
            { 0x58, "あかりの巻物" },
            { 0x59, "壺増大の巻物" },
            { 0x5A, "真空斬りの巻物" },
            { 0x5B, "くちなしの巻物" },
            { 0x5C, "－－の巻物" }, // 時の砂の巻物
            { 0x5D, "ワナの巻物" },
            { 0x5E, "困った時の巻物" },
            { 0x5F, "敵倍速の巻物" },
            { 0x60, "バクスイの巻物" },
            { 0x61, "パワーアップの巻物" },
            { 0x62, "－－の巻物" }, // 全滅の巻物(倉庫なしクリアしていれば効果あり)
            { 0x63, "自爆の巻物" },
            { 0x64, "大部屋の巻物" },
            { 0x65, "モンスターハウスの巻物" },
            { 0x66, "混乱の巻物" },
            { 0x67, "ジェノサイドの巻物" },
            { 0x68, "白紙の巻物" },
            { 0x69, "迷子の巻物" },
            { 0x6A, "天の恵みの巻物" },
            { 0x6B, "地の恵みの巻物" },
            { 0x6C, "メッキの巻物" },
            { 0x6D, "吸い出しの巻物" },
            { 0x6E, "拾えずの巻物" },
            { 0x6F, "－－の巻物" }, // 時限爆弾の巻物(効果なし)
            { 0x70, "新規アイテム" }, // 聖域の巻物
            { 0x71, "新規アイテム" },
            { 0x72, "新規アイテム" },
            { 0x73, "新規アイテム" },
            { 0x74, "新規アイテム" },
            { 0x75, "新規アイテム" },
            { 0x76, "新規アイテム" },
            { 0x77, "新規アイテム" },
            { 0x78, "新規アイテム" },
            { 0x79, "新規アイテム" },
            { 0x7A, "新規アイテム" },
            { 0x7B, "新規アイテム" }, // パルプンテの巻物で、透明で読むことが出来ませんが、めぐすり草を飲むと見えるようになり、グラフィックが通常の巻物とは違います。

            // 杖
            { 0x7C, "封印の杖" },
            { 0x7D, "ふきとばしの杖" },
            { 0x7E, "しあわせの杖" },
            { 0x7F, "不幸の杖" },
            { 0x80, "身がわりの杖" },
            { 0x81, "場所替えの杖" },
            { 0x82, "ブフーの杖" },
            { 0x83, "ガイコツまどうの杖" },
            { 0x84, "かなしばりの杖" },
            { 0x85, "一時しのぎの杖" },
            { 0x86, "痛み分けの杖" },
            { 0x87, "新規アイテム" },
            { 0x88, "新規アイテム" },
            { 0x89, "新規アイテム" },
            { 0x8A, "新規アイテム" },
            { 0x8B, "新規アイテム" },
            { 0x8C, "新規アイテム" },
            { 0x8D, "新規アイテム" },
            { 0x8E, "新規アイテム" },
            { 0x8F, "新規アイテム" },
            { 0x90, "新規アイテム" },
            { 0x91, "新規アイテム" },
            { 0x92, "新規アイテム" },

            // 腕輪
            { 0x93, "通過の腕輪" },
            { 0x94, "値切の腕輪" },
            { 0x95, "ワナ師の腕輪" },
            { 0x96, "レベル固定の腕輪" },
            { 0x97, "回復の腕輪" },
            { 0x98, "錆よけの腕輪" },
            { 0x99, "会心の腕輪" },
            { 0x9A, "痛恨の腕輪" },
            { 0x9B, "呪いよけの腕輪" },
            { 0x9C, "遠投の腕輪" },
            { 0x9D, "しあわせの腕輪" },
            { 0x9E, "垂れ流しの腕輪" },
            { 0x9F, "透視の腕輪" },
            { 0xA0, "混乱よけの腕輪" },
            { 0xA1, "識別の腕輪" },
            { 0xA2, "新規アイテム" },
            { 0xA3, "新規アイテム" },
            { 0xA4, "新規アイテム" },
            { 0xA5, "新規アイテム" },
            { 0xA6, "新規アイテム" },
            { 0xA7, "新規アイテム" },
            { 0xA8, "新規アイテム" },
            { 0xA9, "新規アイテム" },
            { 0xAA, "新規アイテム" },
            { 0xAB, "新規アイテム" },
            { 0xAC, "新規アイテム" },
            { 0xAD, "新規アイテム" },

            // おにぎり
            { 0xAE, "おにぎり" },
            { 0xAF, "大きいおにぎり" },
            { 0xB0, "くさったおにぎり" },
            { 0xB1, "巨大なおにぎり" },
            { 0xB2, "特製おにぎり" },
            { 0xB3, "新規アイテム" },

            // 壺
            { 0xB4, "保存の壺" },
            { 0xB5, "やりすごしの壺" },
            { 0xB6, "分裂の壺" },
            { 0xB7, "強化の壺" },
            { 0xB8, "識別の壺" },
            { 0xB9, "背中の壺" },
            { 0xBA, "倉庫の壺" },
            { 0xBB, "弱化の壺" },
            { 0xBC, "－－－" }, // 手封じの壺(効果なし)
            { 0xBD, "底抜けの壺" },
            { 0xBE, "魔物のるつぼ" },
            { 0xBF, "変化の壺" },
            { 0xC0, "合成の壺" },
            { 0xC1, "トドの壺" },
            { 0xC2, "ガイバラの壺" },
            { 0xC3, "アホくさい壺" },
            { 0xC4, "割れない壺" },
            { 0xC5, "うっぷんばらしの壺" },

            // 花
            { 0xC6, "新規アイテム" },
            { 0xC7, "新規アイテム" },
            { 0xC8, "新規アイテム" },
            { 0xC9, "新規アイテム" },
            { 0xCA, "新規アイテム" },
            { 0xCB, "新規アイテム" },
            { 0xCC, "新規アイテム" },
            { 0xCD, "新規アイテム" },
            { 0xCE, "新規アイテム" },
            { 0xCF, "新規アイテム" },
            { 0xD0, "新規アイテム" },
            { 0xD1, "新規アイテム" },
            { 0xD2, "新規アイテム" },
            { 0xD3, "新規アイテム" },
            { 0xD4, "新規アイテム" },
            { 0xD5, "新規アイテム" },
            { 0xD6, "新規アイテム" },
            { 0xD7, "新規アイテム" },
            { 0xD8, "新規アイテム" },
            { 0xD9, "新規アイテム" },
            { 0xDA, "新規アイテム" },
            { 0xDB, "新規アイテム" },
            { 0xDC, "新規アイテム" },
            { 0xDD, "新規アイテム" },
            { 0xDE, "新規アイテム" },
            { 0xDF, "新規アイテム" },

            // 肉
            { 0xE0, "モンスターの肉" },

            // 目的物
            // グラフィックはコンドルの羽根で、拾うとテーブルマウンテンをクリアしたことになります。
            { 0xE1, "黄金の羽根" },
            { 0xE2, "しあわせの箱" },
            { 0xE3, "奇妙な箱" },
            { 0xE4, "新規アイテム目的物" },

            // その他
            { 0xE5, "ギタン" },
            { 0xE6, "　　　　　　　　　　" }, // 草で、未識別の状態では飲めますが、識別すると透明で飲めなくなり、めぐすり草を飲んでも見えるようにはなりません。 
            { 0xE7, "ンドゥバ" },
        };

        public static Item FromTable(Snes snes, int index)
        {
            Debug.Assert(index < 0x80);
            int code = snes.U8(0x7E8B8C + index);

            var item = new Item()
            {
                Valid = code != 0xFF,
                Name = code != 0xFF ? Item.Names[code] : "",
                InStore = snes.U8(0x7E8E8C + index) != 0,
            };

            if (item.Valid)
            {
                // 壺の中のアイテムリスト
                var nextIndex = index;
                while (true)
                {
                    nextIndex = snes.U8(0x7E8E0C + nextIndex);
                    if (nextIndex == 0xFF)
                        break;

                    item.Contents.Add(Item.FromTable(snes, nextIndex));
                }
            }

            return item;
        }

        public static Item FromShiren(Snes snes, int index)
        {
            Debug.Assert(index < 20);

            var tableIndex = snes.U8(0x7E894F + index);
            if (tableIndex == 0xFF)
                return Item.Invalid();

            return Item.FromTable(snes, tableIndex);
        }

        // 足下のアイテム
        public static Item FromGround(Snes snes)
        {
            int shirenX = snes.U8(0x7E85C8);
            int shirenY = snes.U8(0x7E85DC);

            int itemAddr = 0x7E9EDF + (shirenY * 0x40) + shirenX;
            int itemIndex = snes.U8(itemAddr);

            if (itemIndex < 0x80)
                return Item.FromTable(snes, itemIndex);
            else
                return Item.Invalid();
        }

        public static Item Invalid()
        {
            return new Item() { Valid = false };
        }

        public Item()
        {
            Contents = new List<Item>();
        }

        public string DisplayName
        {
            get
            {
                if (!Valid)
                    return "";

                string flags = "";
                flags += InStore ? "商" : "";

                return string.Format("{0} ({1})", Name, flags);
            }
        }

        public bool Valid { get; set; }
        public string Name { get; set; }
        public bool InStore { get; set; }
        public List<Item> Contents { get; set; }
    }
}
